app/controllers/admin/clients_controller.rb

  def index
    @users = User.paginate :page => params[:page], :per_page => User.find_by_id(session[:user_id]).rows
---
SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1

  def update
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1