app/controllers/admin/orders_controller.rb

  def index
    @orders = Order.paginate :page => params[:page], :per_page => User.find_by_id(session[:user_id]).rows
---
SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1