app/controllers/admin/settings_controller.rb

INSERT INTO `products` (`updated_at`, `title`, `threads`, `price`, `description`, `category_id`, `members`, `posts`, `created_at`) VALUES('2009-04-26 18:12:09', 'Custom Job #152763', 0, 0.0, 'w', 3, 0, 0, '2009-04-26 18:12:09')
---
  def create_new_products
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save