app/controllers/admin_controller.rb

  def index
  	@latest_jobs = Order.all(:limit => 5)
  	@flagged_posts = Post.count
---
SELECT * FROM `orders` LIMIT 5
SELECT count(*) AS count_all FROM `posts`