app/controllers/jobs_controller.rb

SELECT * FROM `participants` WHERE (`participants`.user_id = 4)
SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
---
  def index
  	@participants = User.find(session[:user_id]).participants

SELECT * FROM `participants` WHERE (`participants`.`order_id` = '94') AND (`participants`.user_id = 4) LIMIT 1
---
  def show
  	@job = User.find(session[:user_id]).participants.find_by_order_id(params[:id])

SELECT * FROM `participants` WHERE (`participants`.`order_id` = '106' AND `participants`.`user_id` = 4) LIMIT 1
INSERT INTO `participants` (`removed`, `order_id`, `user_id`) VALUES(0, 106, 4)
---
  def apply
  	if !Participant.find_by_user_id_and_order_id(session[:user_id], params[:id])
  		Participant.create(:user_id => session[:user_id], :order_id => params[:id], :removed => "0")

SELECT * FROM `orders`
---
   def new
   	@orders = Order.all

SELECT * FROM `participants` WHERE (`participants`.`order_id` = '94') AND (`participants`.user_id = 4) LIMIT 1
SELECT * FROM `posts` WHERE (`posts`.order_id = 94)
---
def posts
   	@job = User.find(session[:user_id]).participants.find_by_order_id(params[:id])
   	@my_posts = User.find(session[:user_id]).participants.find_by_order_id(params[:id]).order(params[:id]).posts

SELECT * FROM `participants` WHERE (`participants`.`order_id` = '94') AND (`participants`.user_id = 4) LIMIT 1
---
	def new_post
   	@job = User.find(session[:user_id]).participants.find_by_order_id(params[:id])

INSERT INTO `posts` (`order_id`, `updated_at`, `forum_username`, `date`, `flag`, `post_type`, `user_id`, `created_at`) VALUES(94, '2009-04-26 18:17:02', '', '2009-04-26 00:00:00', NULL, 'Post', 4, '2009-04-26 18:17:02')
SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
UPDATE `users` SET `payment` = 0.2 WHERE `id` = 4
---
  def create_post
    @post = Post.new(params[:post])
    @post.user_id = session[:user_id]


    if @post.save

    	@user = User.find(session[:user_id])
    	@user.payment += @user.per_post
    	@user.save