app/controllers/orders_controller.rb

  def index
    @orders = Order.find_all_by_user_id(session[:user_id]).paginate :page => params[:page], :per_page => User.find_by_id(session[:user_id]).rows

    @current_user = User.find_by_id(session[:user_id])
---
SELECT * FROM `orders` WHERE (`orders`.`user_id` = 4)
SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1

   def show

    @order = User.find(session[:user_id]).orders.find(params[:id])
    @posts = User.find(session[:user_id]).orders.find(params[:id]).posts.count(:conditions => "post_type = 'Post' AND flag = '0'")
    @threads = User.find(session[:user_id]).orders.find(params[:id]).posts.count(:conditions => "post_type = 'Thread' AND flag = '0'")

    @participants = User.find(session[:user_id]).orders.find(params[:id]).participants.count
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 0 AND (`orders`.user_id = 4))
SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
SELECT count(*) AS count_all FROM `posts` WHERE (post_type = 'Post' AND flag = '0') AND (`posts`.order_id = 94)
SELECT count(*) AS count_all FROM `participants` WHERE (`participants`.order_id = 94)

 def writers
    @order 				= User.find(session[:user_id]).orders.find(params[:id])
    @posts 				= User.find(session[:user_id]).orders.find(params[:id]).posts
    @participants = User.find(session[:user_id]).orders.find(params[:id]).participants
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 94 AND (`orders`.user_id = 4))
SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
SELECT * FROM `participants` WHERE (`participants`.order_id = 94)

  def posts
    @order = User.find(session[:user_id]).orders.find(params[:id])
    @posts = Order.find(params[:id]).posts.all
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 94 AND (`orders`.user_id = 4))
SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
SELECT * FROM `posts` WHERE (`posts`.order_id = 94)

  def create

  @order = Order.new(params[:order])
  @order.coupon_code = params[:order][:coupon_code]
  @order.ip_address = request.remote_ip
  @order.user_id = session[:user_id]
  if @order.save
---
INSERT INTO `orders` (`status`, `updated_at`, `card_type`, `express_payer_id`, `express_token`, `product_id`, `coupon_code`, `description`, `card_expires_on`, `user_id`, `forum_title`, `due`, `ip_address`, `created_at`, `forum_url`) VALUES('Active', '2009-04-22 20:40:45', 'visa', NULL, NULL, 1, NULL, NULL, '2009-04-01', 4, 'ForumsNew', NULL, '127.0.0.1', '2009-04-22 20:40:45', 'User')