app/controllers/posts_controller.rb

SELECT * FROM `posts` WHERE (`posts`.`id` = 12)
UPDATE `posts` SET `flag` = 1, `updated_at` = '2009-04-26 18:17:20' WHERE `id` = 12
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])